/*
    Целое число, представляющее собой количество миллисекунд, прошедших с начала 1970 года, называется таймстамп (англ. timestamp).

    Это – легковесное численное представление даты. Из таймстампа всегда можно получить дату с помощью new Date(timestamp) и преобразовать существующий объект Date в таймстамп, используя метод date.getTime() (см. ниже).
*/

// -------------------------------------------------------------------------------
// -------------------------------------- СОЗДАНИЕ -------------------------------
// -------------------------------------------------------------------------------

//=================================================================================
// 1. Пустой конструктор без параметров:

let currentDate = new Date();
console.log(currentDate); // 2022-09-17T06:09:19.589Z

//=================================================================================
// 2. Передаем в конструктор Date количество миллисекунд,
//    которые прошли с начала эпохи Unix, то есть с 1 января 1970 года 00:00:00 GMT:

let myDate = new Date(1359270000000);
console.log(myDate); // 2013-01-27T07:00:00.000Z

//=================================================================================
// 3.  Передаем в конструктор Date день, месяц и год:

let nowDate1 = new Date("17 september 2022");
let nowDate2 = new Date("september 17 2022");
let nowDate3 = new Date("09/17/2022"); // месяц/день/год (иначе Invalid Date)

console.log(nowDate1); // 2022-09-16T15:00:00.000Z
console.log(nowDate2); // 2022-09-16T15:00:00.000Z
console.log(nowDate3); // 2022-09-16T15:00:00.000Z

//=================================================================================
// 4. Передаем в конструктор Date все параметры даты и времени:
//    new Date(год, месяц, число, час, минуты, секунды, миллисекунды)
//    январь - 0, а декабрь - 11.

let date1 = new Date(2012, 11, 25, 18, 30, 20, 10);
let date2 = new Date(2012, 09, 17, 15, 25, 33, 05);

console.log(date1); // 2012-12-25T08:30:20.010Z
console.log(date2); // 2012-10-17T05:25:33.005Z

// -----------------------------------------------
// ---------  ПОЛУЧЕНИЕ ДАТЫ И ВРЕМЕНИ -----------
// -----------------------------------------------

console.log(new Date().getDate()); // 17     дата
console.log(currentDate.getDay()); // 6     день недели (отсчет начинается с 0 - воскресенье, и
//                                                                               последний день - 6 - суббота)

console.log(currentDate.getMonth()); // 8     номер месяца (отсчет начинается с нуля,
//                                                                               то есть месяц с номер 0 - январь)

console.log(currentDate.getFullYear()); // 2022
console.log(currentDate.toDateString()); // Sat Sep 17 2022
console.log(currentDate.getHours()); // 15
console.log(currentDate.getMinutes()); // 34
console.log(currentDate.getSeconds()); // 46
console.log(currentDate.getMilliseconds()); // 805
console.log(currentDate.toTimeString()); // 15:35:55 GMT+0900 (Якутск, стандартное время)

// *********************************************************************************
// ===================== МОЖНО ПАРСИТЬ ПОСМОТРИ ДИБИЛ ==============================

console.log(currentDate.getTime()); // 1663397392010 число миллисекунд, прошедших с
//                                                                         1 января 1970 года GMT+0, то есть того же вида,
//                                                                         который используется в конструкторе new Date
//                                                                         (milliseconds).

console.log(currentDate.getTimezoneOffset()); // -540  разница между местным и UTC-временем, в минутах.

// ===================== МОЖНО ПАРСИТЬ ПОСМОТРИ ДИБИЛ ==============================

console.log(Date.parse("January 26, 2011 13:51:50")); // 1296017510000 разбирает строку str в формате
//                                                                         YYYY-MM-DD или YYYY-MM или даже только YYYY
//                                                                         и возвращает соответствующее ей количество миллисекунд

let мяу = Date.now();
console.log("Date.now() " + мяу); // 1663399418217 возвращает дату сразу в виде миллисекунд

// -----------------------------------------------
// ---------  УСТАНОВКА ДАТЫ И ВРЕМЕНИ -----------
// -----------------------------------------------

let now = new Date();
console.log(now); // 2022-09-17T06:40:45.747Z
now.setFullYear(1111);
now.setMonth(01); // 1111-01-11T07:02:56.639Z
now.setDate(3);
now.setHours(4);
now.setMinutes(5);
now.setSeconds(6);
now.setMilliseconds(777);

console.log(now); // 1111-02-02T19:26:08.777Z